OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/cc2510fx.h
// From table 68: xdata RF registers

SFRX(SYNC1,      0xDF00); // Sync word, high byte 
SFRX(SYNC0,      0xDF01); // Sync word, low byte 
SFRX(PKTLEN,     0xDF02); // Packet length 
SFRX(PKTCTRL1,   0xDF03); // Packet automation control 
SFRX(PKTCTRL0,   0xDF04); // Packet automation control 
SFRX(ADDR,       0xDF05); // Device address 
SFRX(CHANNR,     0xDF06); // Channel number 
SFRX(FSCTRL1,    0xDF07); // Frequency synthesizer control 
SFRX(FSCTRL0,    0xDF08); // Frequency synthesizer control 
SFRX(FREQ2,      0xDF09); // Frequency control word, high byte 
SFRX(FREQ1,      0xDF0A); // Frequency control word, middle byte 
SFRX(FREQ0,      0xDF0B); // Frequency control word, low byte 
SFRX(MDMCFG4,    0xDF0C); // Modem configuration 
SFRX(MDMCFG3,    0xDF0D); // Modem configuration 
SFRX(MDMCFG2,    0xDF0E); // Modem configuration 
SFRX(MDMCFG1,    0xDF0F); // Modem configuration 
SFRX(MDMCFG0,    0xDF10); // Modem configuration 
SFRX(DEVIATN,    0xDF11); // Modem deviation setting 
SFRX(MCSM2,      0xDF12); // Main Radio Control State Machine configuration 
SFRX(MCSM1,      0xDF13); // Main Radio Control State Machine configuration 
SFRX(MCSM0,      0xDF14); // Main Radio Control State Machine configuration 
SFRX(FOCCFG,     0xDF15); // Frequency Offset Compensation configuration 
SFRX(BSCFG,      0xDF16); // Bit Synchronization configuration 
SFRX(AGCCTRL2,   0xDF17); // AGC control 
SFRX(AGCCTRL1,   0xDF18); // AGC control 
SFRX(AGCCTRL0,   0xDF19); // AGC control 
SFRX(FREND1,     0xDF1A); // Front end RX configuration 
SFRX(FREND0,     0xDF1B); // Front end TX configuration 
SFRX(FSCAL3,     0xDF1C); // Frequency synthesizer calibration 
SFRX(FSCAL2,     0xDF1D); // Frequency synthesizer calibration 
SFRX(FSCAL1,     0xDF1E); // Frequency synthesizer calibration 
SFRX(FSCAL0,     0xDF1F); // Frequency synthesizer calibration 
SFRX(PA_TABLE7,  0xDF27); // PA output power setting 
SFRX(PA_TABLE6,  0xDF28); // PA output power setting 
SFRX(PA_TABLE5,  0xDF29); // PA output power setting 
SFRX(PA_TABLE4,  0xDF2A); // PA output power setting 
SFRX(PA_TABLE3,  0xDF2B); // PA output power setting 
SFRX(PA_TABLE2,  0xDF2C); // PA output power setting 
SFRX(PA_TABLE1,  0xDF2D); // PA output power setting 
SFRX(PA_TABLE0,  0xDF2E); // PA output power setting 
SFRX(IOCFG2,     0xDF2F); // GDO2 output pin configuration 
SFRX(IOCFG1,     0xDF30); // GDO1 output pin configuration 
SFRX(IOCFG0,     0xDF31); // GDO0 output pin configuration 
SFRX(PARTNUM,    0xDF36); // Chip Identifier 
SFRX(VERSION,    0xDF37); // Configuration 
SFRX(FREQEST,    0xDF38); // Frequency Offset Estimate 
SFRX(LQI,        0xDF39); // Link Quality Indicator 
SFRX(RSSI,       0xDF3A); // Received Signal Strength Indication 
SFRX(MARCSTATE,  0xDF3B); // Main Radio Control State 
SFRX(PKTSTATUS,  0xDF3C); // Packet status 
SFRX(VCO_VC_DAC, 0xDF3D); // PLL calibration current 

// I2S Registers

SFRX(I2SCFG0,  0xDF40); // I2S Configuration Register 0 
SFRX(I2SCFG1,  0xDF41); // I2S Configuration Register 1 
SFRX(I2SDATL,  0xDF42); // I2S Data Low Byte 
SFRX(I2SDATH,  0xDF43); // I2S Data High Byte 
SFRX(I2SWCNT,  0xDF44); // I2S Word Count Register 
SFRX(I2SSTAT,  0xDF45); // I2S Status Register 
SFRX(I2SCLKF0, 0xDF46); // I2S Clock Configuration Register 0 
SFRX(I2SCLKF1, 0xDF47); // I2S Clock Configuration Register 1 
SFRX(I2SCLKF2, 0xDF48); // I2S Clock Configuration Register 2

// Common USB Registers

SFRX(USBADDR,  0xDE00); // Function Address
SFRX(USBPOW,   0xDE01); // Power/Control Register
SFRX(USBIIF,   0xDE02); // IN Endpoints and EP0 Interrupt Flags
SFRX(USBOIF,   0xDE04); // OUT Endpoints Interrupt Flags
SFRX(USBCIF,   0xDE06); // Common USB Interrupt Flags
SFRX(USBIIE,   0xDE07); // IN Endpoints and EP0 Interrupt Enable Mask
SFRX(USBOIE,   0xDE09); // Out Endpoints Interrupt Enable Mask
SFRX(USBCIE,   0xDE0B); // Common USB Interrupt Enable Mask
SFRX(USBFRML,  0xDE0C); // Current Frame Number (Low byte)
SFRX(USBFRMH,  0xDE0D); // Current Frame Number (High byte)
SFRX(USBINDEX, 0xDE0E); // Selects current endpoint.

// Indexed Endpoint Registers

SFRX(USBMAXI, 0xDE10); // Max. packet size for IN endpoint
SFRX(USBCS0,  0xDE11); // EP0 Control and Status (USBINDEX = 0)
SFRX(USBCSIL, 0xDE11); // IN EP{1-5} Control and Status Low
SFRX(USBCSIH, 0xDE12); // IN EP{1-5} Control and Status High
SFRX(USBMAXO, 0xDE13); // Max. packet size for OUT endpoint
SFRX(USBCSOL, 0xDE14); // OUT EP{1-5} Control and Status Low
SFRX(USBCSOH, 0xDE15); // OUT EP{1-5} Control and Status High
SFRX(USBCNT0, 0xDE16); // Number of received bytes in EP0 FIFO (USBINDEX = 0)
SFRX(USBCNTL, 0xDE16); // Number of bytes in OUT FIFO Low
SFRX(USBCNTH, 0xDE17); // Number of bytes in OUT FIFO High

// Endpoint FIFO Registers

SFRX(USBF0, 0xDE20); //  Endpoint 0 FIFO
SFRX(USBF1, 0xDE22); //  Endpoint 1 FIFO
SFRX(USBF2, 0xDE24); //  Endpoint 2 FIFO
SFRX(USBF3, 0xDE26); //  Endpoint 3 FIFO
SFRX(USBF4, 0xDE28); //  Endpoint 4 FIFO
SFRX(USBF5, 0xDE2A); //  Endpoint 5 FIFO

// SFRs also accesible through XDATA space

SFRX(X_U0CSR,    0xDF86); // USART 0 Control and Status
SFRX(X_P0IFG,    0xDF89); // Port 0 Interrupt Status Flag
SFRX(X_P1IFG,    0xDF8A); // Port 1 Interrupt Status Flag
SFRX(X_P2IFG,    0xDF8B); // Port 2 Interrupt Status Flag
SFRX(X_PICTL,    0xDF8C); // Port Pins Interrupt Mask and Edge
SFRX(X_P1IEN,    0xDF8D); // Port 1 Interrupt Mask
SFRX(X_P0INP,    0xDF8F); // Port 0 Input Mode
SFRX(X_RFIM,     0xDF91); // RF Interrupt Mask
SFRX(X_MPAGE,    0xDF93); // Memory Page Select 
SFRX(X_T2CT,     0xDF9C); // Timer 2 Control
SFRX(X_T2PR,     0xDF9D); // Timer 2 Prescaler
SFRX(X_T2CTL,    0xDF9E); // Timer 2 Control
SFRX(X_WORIRQ,   0xDFA1); // Timer Sleep Timer Interrupts
SFRX(X_WORCTL,   0xDFA2); // Sleep Timer Control 
SFRX(X_WOREVT0,  0xDFA3); // Timer Sleep Timer Event 0 Timeout Low Byte
SFRX(X_WOREVT1,  0xDFA4); // Timer Sleep Timer Event 0 Timeout High Byte
SFRX(X_WORTIME0, 0xDFA5); // Sleep Timer Value 0 
SFRX(X_WORTIME1, 0xDFA6); // Sleep Timer Value 1 
SFRX(X_FWT,      0xDFAB); // Flash Write Timing
SFRX(X_FADDRL,   0xDFAC); // Flash Address Low
SFRX(X_FADDRH,   0xDFAD); // Flash Address High
SFRX(X_FCTL,     0xDFAE); // Flash Control
SFRX(X_FWDATA,   0xDFAF); // Flash Write Data
SFRX(X_ENCDI,    0xDFB1); // Encryption/Decryption Input Data
SFRX(X_ENCDO,    0xDFB2); // Encryption/Decryption Output Data
SFRX(X_ENCCS,    0xDFB3); // Encryption/Decryption Control and Status
SFRX(X_ADCCON1,  0xDFB4); // ADC Control 1
SFRX(X_ADCCON2,  0xDFB5); // ADC Control 2
SFRX(X_ADCCON3,  0xDFB6); // ADC Control 3
SFRX(X_ADCL,     0xDFBA); // ADC Data Low
SFRX(X_ADCH,     0xDFBB); // ADC Data High
SFRX(X_RNDL,     0xDFBC); // Random Number Generator Data Low
SFRX(X_RNDH,     0xDFBD); // Random Number Generator Data High
SFRX(X_SLEEP,    0xDFBE); // Flash Write Timing
SFRX(X_U0DBUF,   0xDFC1); // USART 0 Receive/Transmit Data Buffer
SFRX(X_U0BAUD,   0xDFC2); // USART 0 Baud Rate Control
SFRX(X_U0UCR,    0xDFC4); // USART 0 UART Control
SFRX(X_U0GCR,    0xDFC5); // USART 0 Generic Control
SFRX(X_CLKCON,   0xDFC6); // Clock Control
SFRX(X_MEMCTR,   0xDFC7); // Memory System Control
SFRX(X_WDCTL,    0xDFC9); // Watchdog Timer Control
SFRX(X_T3CNT,    0xDFCA); // Timer 3 Counter
SFRX(X_T3CTL,    0xDFCB); // Timer 3 Control
SFRX(X_T3CCTL0,  0xDFCC); // Timer 3 Channel 0 Capture/Compare Control
SFRX(X_T3CC0,    0xDFCD); // Timer 3 Channel 0 Capture/Compare Value
SFRX(X_T3CCTL1,  0xDFCE); // Timer 3 Channel 1 Capture/Compare Control
SFRX(X_T3CC1,    0xDFCF); // Timer 3 Channel 1 Capture/Compare Value
SFRX(X_DMAIRQ,   0xDFD1); // DMA Interrupt Flag
SFRX(X_DMA1CFGL, 0xDFD2); // DMA Channel 1-4 Configuration Address Low Byte
SFRX(X_DMA1CFGH, 0xDFD3); // DMA Channel 1-4 Configuration Address High Byte
SFRX(X_DMA0CFGL, 0xDFD4); // DMA Channel 0 Configuration Address Low Byte
SFRX(X_DMA0CFGH, 0xDFD5); // DMA Channel 0 Configuration Address High Byte
SFRX(X_DMAARM,   0xDFD6); // DMA Channel Arm
SFRX(X_DMAREQ,   0xDFD7); // DMA Channel Start Request and Status
SFRX(X_TIMIF,    0xDFD8); // Timers 1/3/4 Joint Interrupt Mask/Flags
SFRX(X_RFD,      0xDFD9); // RF Data
SFRX(X_T1CC0L,   0xDFDA); // Timer 1 Channel 0 Capture/Compare Value Low
SFRX(X_T1CC0H,   0xDFDB); // Timer 1 Channel 0 Capture/Compare Value High
SFRX(X_T1CC1L,   0xDFDC); // Timer 1 Channel 1 Capture/Compare Value Low
SFRX(X_T1CC1H,   0xDFDD); // Timer 1 Channel 1 Capture/Compare Value High
SFRX(X_T1CC2L,   0xDFDE); // Timer 1 Channel 2 Capture/Compare Value Low
SFRX(X_T1CC2H,   0xDFDF); // Timer 1 Channel 2 Capture/Compare Value High
SFRX(X_RFST,     0xDFE1); // RF Strobe Commands
SFRX(X_T1CNTL,   0xDFE2); // Timer 1 Counter Low
SFRX(X_T1CNTH,   0xDFE3); // Timer 1 Counter High
SFRX(X_T1CTL,    0xDFE4); // Timer 1 Control and Status
SFRX(X_T1CCTL0,  0xDFE5); // Timer 1 Channel 0 Capture/Compare Control
SFRX(X_T1CCTL1,  0xDFE6); // Timer 1 Channel 1 Capture/Compare Control
SFRX(X_T1CCTL2,  0xDFE7); // Timer 1 Channel 2 Capture/Compare Control
SFRX(X_RFIF,     0xDFE9); // RF Interrupt flags
SFRX(X_T4CNT,    0xDFEA); // Timer 4 Counter
SFRX(X_T4CTL,    0xDFEB); // Timer 4 Control
SFRX(X_T4CCTL0,  0xDFEC); // Timer 4 Channel 0 Capture/Compare Control
SFRX(X_T4CC0,    0xDFED); // Timer 4 Channel 0 Capture/Compare Value
SFRX(X_T4CCTL1,  0xDFEE); // Timer 4 Channel 1 Capture/Compare Control
SFRX(X_T4CC1,    0xDFEF); // Timer 4 Channel 1 Capture/Compare Value
SFRX(X_PERCFG,   0xDFF1); // Peripheral I/O Control
SFRX(X_ADCCFG,   0xDFF2); // ADC Input Configuration
SFRX(X_P0SEL,    0xDFF3); // Port 0 Function Select
SFRX(X_P1SEL,    0xDFF4); // Port 1 Function Select
SFRX(X_P2SEL,    0xDFF5); // Port 2 Function Select
SFRX(X_P1INP,    0xDFF6); // Port 1 Input Mode
SFRX(X_P2INP,    0xDFF7); // Port 2 Input Mode
SFRX(X_U1CSR,    0xDFF8); // USART 1 Control and Status
SFRX(X_U1DBUF,   0xDFF9); // USART 1 Receive/Transmit Data Buffer
SFRX(X_U1BAUD,   0xDFFA); // USART 1 Baud Rate Control
SFRX(X_U1UCR,    0xDFFB); // USART 1 UART Control
SFRX(X_U1GCR,    0xDFFC); // USART 1 Generic Control
SFRX(X_P0DIR,    0xDFFD); // Port 0 Direction
SFRX(X_P1DIR,    0xDFFE); // Port 1 Direction
SFRX(X_P2DIR,    0xDFFF); // Port 2 Direction

#endif //REG_CC2510FX_H

